Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Добавлена группа компонентов «Программирование» (включает в себя Python и JavaScript).
en: "Scripting" group of components was added (includes Python and JavaScript).

source: Добавлена обработка заголовков X-Forwarded-Proto и X-Forwarded-Host.
en: Processing of X-Forwarded-Proto and X-Forwarded-Host headers was added.

source: Добавлена поддержка PostgreSQL 12.
en: PostgreSQL 12. support was added.

source: Добавлена поддержка Python 3.6 и ниже, установленного по не-ASCII пути (#8429).
en: Support of Python 3.6 and lower set not by ASCII path was added (#8429).

source: Добавлена поддержка Python.
en: Python support was added.

source: Добавлена поддержка TLS 1.3.
en: TLS 1.3 support was added.

source: Добавлена поддержка глобального свойства globalThis, которое может быть использовано сторонними модулями.
en: Support of the global property globalThis was added. It can be used by the third-party modules.

source: Добавлена поддержка методов PUT, DELETE и PATCH в мастерах настройки подключения REST-запроса.
en: Support of PUT, DELETE and PATCH methods was added in REST request connection wizards.

source: Добавлена проверка на нулевой размер группы при получении размера выборки, чтобы не получалась ситуация выборки 1 элемента из 0, а также исправлено некорректное получение номера строки для записи в выборку, что исключает ошибку (#8728).
en: The zero group size check was added when receiving the sample size to exclude the situation when 1 item from 0 was selected, and also incorrect obtaining of the row number to be recorded to the sample was corrected to exclude the error (#8728).

source: Добавлена установка действующей локали приложения при создании настроек приложения по умолчанию (#9073).
en: The active application locale setup was added when creating the default application settings (#9073).

source: Добавлено автоматизированное end-to-end тестирование, что позволит существенно повысить надежность приложения.
en: The automated end-to-end testing was added that enabled to enhance the application reliability significantly.

source: Добавлено отображение дробной части у показателя «Среднее» для полей Целого типа (#9196).
en: Display of the decimal part of the "Average" indicator for the Integer fields was added (#9196).

source: Добавлено отображение таких значений специальным (серым) цветом и в угловых кавычках: <null>, <Пустая строка>.
en: Display of such values in special (grey) color and in French quotation marks was added: <null>, <Empty string>.

source: Добавлены всплывающие подсказки с полным текстом, отображаемые при наведении на поле или метку поля.
en: Tips with full text displayed when hovering a cursor over the field or field caption were added.

source: Дополнительно в администрировании Loginom 6.5 появилась отдельная роль и возможность управлять правами на публикацию веб-сервисов.
en: Besides, a separate role appeared in Loginom 6.5 administration. And it became possible to control the web services publication rights.

source: Доработали процесс экспорта в очередь Kafka: если за 1000 запросов отправки не отправлено ни одного сообщения, то записывается сообщение в лог, а если за 4000 запросов не отправлено ни одного сообщения — экспорт будет остановлен, а пользователь получит соответствующее сообщение об ошибке (#9506).
en: Export to Kafka queue process was improved. If no message is sent for 1000 send requests, the message is recorded in the log, and if no message is sent for 4000 requests, export will be terminated and the user will receive corresponding error message (#9506).

source: Доработано копирование и вставка в различных режимах фильтра измерения «Куба», а именно:
en: Copy and paste operations were improved in the different "Cube" dimension filter modes as follows:

source: Достаточно экспортировать любые данные в формат lgd и работа с ними будет в несколько раз быстрее, также они будут занимать гораздо меньший объем памяти в хранилище.
en: It is sufficient to export any data to the lgd format, and it will be possible to work with it several times faster, and it will take much less memory size in the warehouse.

source: Доступна команда копирования значения в буфер обмена.
en: Command to copy value to the clipboard became available.

source: Доступна общая сводка по набору данных, а также детализированные сводки по непрерывным и по дискретным данным.
en: The general data set summary and detailed summaries for the continuous and discrete data are available.

source: Доступны 3 варианта отображения, между которыми можно переключаться:
en: 3 display options that can be switched are available:

source: Доступны для импорта популярные библиотеки, используемые при анализе данных на Python: NumPy, Pandas, Scikit-learn и другие.
en: The popular libraries used for Python data analysis are available for import: NumPy, Pandas, Scikit-learn, etc.

source: Древовидная структура при импорте из Хранилища данных
en: Tree-Like Structure when Importing from the Data Warehouse

source: Дубликаты и противоречия
en: Duplicates Detection

source: Ее значение соответствует либо пропущенному значению null по умолчанию, либо значению идентификатора запроса при выполнении узла сценария через Loginom Integrator.
en: Its value matches either null value by default, or the request identifier value when executing the workflow node by means of Loginom Integrator.

source: Если urlPathPrefix="abc", то адрес меняется на: http://localhost/lgi/abc/rest/help.
en: If urlPathPrefix="abc", address was changed as follows: http://localhost/lgi/abc/rest/help.

source: Если API journald не доступно, сообщение записывается в stderr.
en: If API journald is not available, the message is recorded in stderr.

source: Если BatchLauncher запущен без параметров, то, как и ранее, на экран будет выведена справка по использованию утилиты (#9626).
en: If BatchLauncher is started without parameters, the utility usage guidelines will be displayed as before (#9626).

source: Если Loginom Server находится не на localhost относительно Интегратора, то при установке Loginom Integrator значение параметра Unix Socket, заданное по умолчанию, необходимо удалить (оставить поле пустым), чтобы избежать лишних попыток подключения.
en: If Loginom Server is not on localhost relative to Integrator, when installing Loginom Integrator, Unix Socket parameter value set by default must be deleted (leave the field empty) to avoid unnecessary connection attempts.

source: Если Подмодель выполнялась в Цикле, то это повышало вероятность возникновения ошибки (#8514).
en: If the Supernode was executed in the Loop, it increased the risk of error occurrence(#8514).

source: Если атрибут отсутствует или содержит отрицательное значение, то используется значение по умолчанию: 2147483647.
en: If there is no attribute or if it contains the negative value, the following default value is used: 2147483647.

source: Если в конфигурационном файле Loginom Integrator задать значение атрибута urlPathPrefix="Service.svc", то дополнительно генерируется wsdl по адресу /Service.svc?wsdl, который использовался в старом Интеграторе.
en: If the value of urlPathPrefix="Service.svc" attribute is set in the Loginom configuration file, wsdl is additionally generated by the following address: /Service.svc?wsdl that is used in the old Integrator.

source: Если в наборе данных у дискретного поля имелись выбросы, но не было экстремальных значений, то при выделении ячейки с информацией о выбросах пользователь видел пустую таблицу Детализация, а не строки, в которых найдены выбросы (#9209).
en: If there were outliers in the data set of the discrete field but there were no extreme values, when selecting the cell with information on outliers, a user could see the empty Detailing table but not the rows in which outliers were detected (#9209).

source: Если в настройках публикации пакета установлен параметр «Обновлять публикацию при сохранении пакета», то при любом редактировании веб-сервиса и сохранении пакета он будет автоматически переопубликован с учетом самых последних изменений.
en: If "Update publication on package saving" parameter is set in the package publication settings, it will be automatically republished taking into account the recent changes after each web service editing and package saving.

source: Если в окне интерактивного визуализатора мастера настройки узла отредактировать верхнюю границу первого класса, а затем изменить верхнюю границу последующего класса, то после нажатия клавиши Enter изменялась и нижняя граница второго класса.
en: If the upper bound of the first class was edited in the interactive visualizer window of the node wizard, and then the upper bound of the next class was changed, also the lower bound of the second class was changed after pressing Enter.

source: Если в процессе выполнения кода Python возникнут критические ошибки, то приложение может аварийно завершится.
en: If critical errors occur while executing the Python code, the application can be crashed.

source: Если в течение таймаута не удалось завершить активные процессы, то выдаётся сообщение об ошибке.
en: If all active processes are not finished during the timeout, the error message will appear.

source: Если в указанной папке отсутствует файл Integrator.dll.config, то Integrator не запускается, а пользователь получает сообщение об ошибке.
en: If there is no Integrator.dll.config file in the specified folder, Integrator is not started, and the user receives an error message.

source: Если в файле Integrator.dll.config значением атрибута workDir является относительный путь, то он интерпретируется как путь относительно файла Integrator.dll.config.
en: If in Integrator.dll.config file the value of workDir attribute is the relative path, it is interpreted as the path relative to Integrator.dll.config file.

source: Если выбрать опцию «Выполнение узла и Цикл», то будет доступно выполнение компонента или выполнение в цикле.
en: If "Node Execution and Loop" option is selected, the component execution or loop execution will be available.

source: Если выбрать опцию «Производные узлы», то можно модифицировать компонент перед его переиспользованием.
en: If "Derived Nodes" option is selected, it will be possible to modify the component before its reuse.

source: Если для входного поля обученного узла Конечны классы установить значения параметра Максимальное количество классов равным 0 и активировать узел, то возникала ошибка «Значение 0 параметра "Index" вне диапазона [-1; -1]», после чего изменить значение указанного параметра для этого поля было невозможно.
en: If for the input field of the trained Coarse classes node the Maximum class count parameter value is set equal to 0 and the node is activated, the following error occurrs: "Value 0 of "Index" parameter is out of [-1; -1] range", after that it is impossible to change the value of the specified parameter for this field.

source: Если для поля установлено свойство «Исключить», то это поле не будет добавлено в выходной набор данных.
en: If "Exclude" property is set for the field, this field will not be added to the output data set.

source: Если дополнительные потоки простаивают, то они постепенно удаляются, чтобы снизить потребление оперативной памяти.
en: If additional threads are not used, they are gradually deleted to decrease the memory consumption.

source: Если же Loginom Server уже обновлен, то можно вручную отредактировать xml-файл Users.cfg и удалить из него пользователя с именем «everyone».
en: If the Loginom Server has already been updated, it is possible to edit the xml file Users.cfg manually and delete the user with "everyone" name from it.

source: Если же в настройках компонента запрещено создание узлов Выполнение/Цикл, то всегда создаётся производный узел.
en: If it is not allowed to create Execution/Loop nodes in the component settings, the derived node is always created.

source: Если же среди выбранных подключений есть как активные, так и не активные, то при нажатии кнопки будут протестированы только неактивные подключения (#8304).
en: If there are both active and inactive connections among the selected connections, only inactive connections will be tested when pressing on the button (#8304).

source: Если к пакету подключаются библиотеки компонентов, к которым нет доступа на редактирование, то необходимо запросить новые версии библиотек у их разработчика.
en: If the component libraries with no edit access are connected to the package, it is necessary to request their developer to provide the new libraries versions.

source: Если логи перенаправляются из консоли контейнера в journald хоста, то многострочные сообщения разбиваются на несколько (каждая строка получается отдельным сообщением в journald).
en: If logs are redirected from the container console to host journald, the multiline messages are divided into several ones (each line becomes a separate message in journald).

source: Если ни одного зависимого узла не найдено, но производный компонент имеет модификатор доступа «Открытый», то об этом также сообщается (#9004).
en: If no dependent nodes are found but the derived component has "Public" visibility, this information is also provided (#9004).

source: Если опубликованный узел отработал с ошибкой, и при закрытии пакета возникла ошибка, то информация о первой ошибке не потеряется (#9290).
en: If the published node was used with an error, and when closing the package, an error occurred, the information on the first error was not lost (#9290).

source: Если пользователь завершал настройку игнорируя ошибки, то данные импортировались, но все поля имели переменный тип данных (#5790).
en: If the configuration process was finished by the user in disregard for errors, the data was imported but all fields were related to the variable data type (#5790).

source: Если после объединения классов, нажать на одну из кнопок, то происходило объединение классов, несмотря на то, что ни один из классов не был выделен.
en: If one of the buttons was pressed upon classes merging, classes were merged, in spite of the fact that none of the classes had been selected.

source: Если после этого нажать кнопку Отмена, снова изменить тип данных замены на Дата/Время и попытаться изменить данные в поле Точное совпадение, то интерфейс приложения полностью ломался.
en: If Cancel button was pressed afterwards, replacement data type was changed to Date/Time again, and attempts were made to change data in the Exact match field, these actions caused the total failure of the application interface.

source: Если при заполнении массивов numpy возникает необходимость обработки пропущенных значений целочисленного и логического типов, то используется вещественный тип, а пропущенные значения преобразуются в NaN (np.nan).
en: If it is required to process the null values related to the integer and logical types when filling numpy arrays, the real type is used, and null values are transformed to NaN (np.nan).

source: Если при редактировании этих параметров будут указаны IP-адрес и порт занятые другим веб-сайтом, то пользователь получит сообщение об ошибке и установка остановится (#9939).
en: If when editing these parameters the IP address and port occupied by another web site are specified, the user will receive an error message and installation process will be stopped (#9939).

source: Если процессор загружен меньше, чем на 80% и есть очередь процессов на выполнение, то количество рабочих потоков увеличивается, пока загрузка процессора не превысит 80%.
en: If the processor is loaded less than by 80%, and there is a queue of the processes to be executed, the count of worker threads is increased until the processor load exceeds 80%.

source: Если ранее была настроена автоматическая обработка лог-файлов при помощи скриптов, в которых делалось предположение о кодировке лог файлов, то в этом случае нужно обратить внимание на это изменение.
en: If the automatic processing of log files was previously configured using the scripts in which it was assumed on the log files encoding, in this case it is required to pay attention to this change.

source: Если ранее возникала ошибка, то после обновления необходимо повторно пройти мастер настройки экспорта (#8585).
en: If the error has been identified before, it is required to go to the export configuration wizard once again after update (#8585).

source: Если ранее имелся пользователь с именем «everyone», то при запуске сервера возникнет ошибка «Ошибка загрузки файла конфигурации: Users.cfg» (сообщение сохранится в журнал Windows и в файл лога), а Loginom Server не запустится.
en: When it was referred to a user with "everyone" name, when starting the server, the following error occurred: "Configuration file loading error: Users.cfg" (the message will be kept in the Windows log and log file) and the Loginom Server did not start.

source: Если среди уникальных значений поля было пропущенное значение, пустая строка или строка, состоящая только из пробельных символов, то такие значения не отображались в этом выпадающем списке.
en: If there was a null value among the unique field values, empty string or the string that consisted of only white spaces, such values were not displayed in the drop-down list.

source: Если у входных портов есть связи, то по крайней мере один входной порт должен быть подключен к активной ветви.
en: If there are input ports connections, at least, one input port must be connected to the active branch.

source: Если у производного компонента запрашивается конфигурация (например, при загрузке пакета, содержащего производный узел) и при этом в компоненте закэширована устаревшая конфигурация, а базовый узел заблокирован (например, если пакет, в котором находится базовый узел, открыт как общий и активируется в рамках другой сессии пользователя), то не выводится сообщение об ошибке, а используется эта устаревшая конфигурация, и пишется сообщение в лог (#9251).
en: If configuration was requested for the derived component (for example, when loading the package that contained the derived node), and in this case, the outdated configuration was cached in the component, and the base node was locked (for example, if the package in which the base node was located, was opened as the public one and it was activated within another user session), an error message was not displayed, this outdated configuration was used, and message was recorded to the log (#9251).

source: Еще одно новшество — это гибкая настройка импорта данных из хранилища при помощи переменных.
en: One more novelty is represented by the flexible configuration of the data import from the storage using variables.

source: За счет переиспользования ранее спроектированных и проверенных компонентов повышается качество итоговых сценариев, а возможность делиться такими компонентами — многократно повышает производительность работы аналитика.
en: Due to the reuse of the earlier designed and checked components, the quality of the final workflows is improved, and possibility to share such components increases many times the analyst's performance.

source: За счет перехода с UTF16 на UTF-8 увеличилась скорость импорта и экспорта csv-файлов, в некоторых случаях в 1.3 раза.
en: The speed of csv files import and export was increased by 1.3 times due to transition from UTF16 to UTF-8.

source: Заголовки, указанные на странице мастера настройки узла REST-запрос "Настройка пользовательских заголовков", а также переопределенные значения стандартных заголовков не попадали в файл.
en: The headers specified on the wizard page of REST request node "Configure user headers" and redefined values of standard headers were not included into the file.

source: Задание весов для записей при настройке Логистической регрессии
en: Setting weights for records while Logistic Regression configuring

source: Задание весов для отдельных записей, используемых при обучении модели позволяет получить более точную модель в том случае, если требуется учитывать значимость отдельной записи в наборе данных.
en: Setting weights for separate records used while model training provides more accurate model if it is required to consider significance of a separate record in the data set.

source: Задание весов и калибровка моделей Логистической регрессии.
en: Setting weights and model calibration of Logistic Regression.

source: Задачу анализа данных так или иначе можно решить в различных инструментах.
en: Data analysis task can be somehow completed using different tools.

source: Закрыть это окно Loginom CE можно было только через Диспетчер задач.
en: It was possible to close this Loginom CE window only using the Sesson Manager.

source: Запись осуществляется при уровне «Информация».
en: Record is performed at the "Information" level.

source: Запрос к URL ""..."" завершился с ошибкой ...
en: Request to URL ""..."" was terminated with error ...

source: Затронутые параметры: «Кодовая страница» для баз данных Interbase/Firebird или MS SQL, а также «Зашифрованная БД» для SQLite (#8759).
en: Impacted parameters: "Codepage" for Interbase/Firebird or MS SQL databases and also "Encoded DB" for SQLite (#8759).

source: Значение Random Seed можно задать через переменную, сгенирировать или установить флаг «Всегда случайно».
en: Random Seed value can be set via variable, it is also possible to generate or select "Always randomly" checkbox.

source: Значение атрибута workDir может равняться . (текущая папка).
en: Value ofworkDir attribute can be equal to . (current folder).

source: Значение опции «Сравнивать строковые уникальные значения бинарно» выводится в Инспекторе свойств.
en: Value of "Compare string unique values in a binary way" option is displayed in the Property Inspector.

source: Значение этого атрибута по умолчанию — пустая строка.
en: An empty string is the default value of this attribute.

source: Из-за неправильной установки фокуса мог некорректно работать функционал копирования–вставки через горячие клавиши (#8023, #8516).
en: Incorrect focusing could cause incorrect hotkey operation of copy-paste functionality (#8023, #8516).

source: Из-за ошибки на некоторых наборах данных визуализатор не отображался (#9839).
en: Due to an error the visualizer was not displayed in some data sets (#9839).

source: Из-за этого было невозможно выполнить в цикле импорт из нескольких листов книги Excel (#9266).
en: That's why it was not possible to import from several Excel workbook sheets in the loop(#9266).

source: Из-за этого при запуске сценария могли возникать конфликты локалей.
en: It can cause locale conflict when starting the workflow.

source: Изменен алгоритм генерации псевдослучайных чисел.
en: Algorithm of pseudorandom numbers generation was changed.

source: Изменен порядок автоматического формирования имен полей.
en: The order of the automatic fields names generation was changed.

source: Изменение в автоматическом формирование имен полей
en: Change in the Automatic Fields Names Generation

source: Изменение этих параметров для существующего сайта без его конфигурирования приводило к тому, что не работали ярлыки для описания сервисов.
en: Change of these parameters for the existing site without its configuration led to the fact that service description shortcuts did not work.

source: Изменения в Loginom Integrator
en: Changes in Loginom Integrator

source: Изменения в Loginom версии 6.4.0
en: Changes in Loginom 6.4.0

source: Изменения в логировании
en: Changes in Logging

source: Изменения в переносимости сценариев
en: Changes in the Workflow Transferability

source: Изменения в проектировании и отладке сценариев
en: Changes in the Workflow Design and Debugging

source: Изменения в разделе Администрирование
en: Changes in the Administration Section

source: Изменения в системных требованиях
en: Changes in the System Requirements
